[
  {
    "name": "Madisyn Robb",
    "title": "Secretary",
    "term": "2024 – Present",
    "description": "Madisyn Robb is a freshman at Central Michigan University, where she serves as one of the Membership and Data Organizer for the Campus Democrats. Pursuing a major in History with a minor in Spanish, Madisyn aspires to become a history teacher. In addition to her political involvement, she plays trombone in the CMU Marching Band and is a member of the Rho Delta chapter of the Phi Mu sorority. Madisyn enjoys watching football and baseball games with her friends in her free time, as well as reading and writing.",
    "objectPosition": [0, 0],
    "emailAddress": "robb1mg@cmich.edu"
  },
  {
    "name": "Carli Paukette",
    "title": "Director of Outreach",
    "term": "2024 – Present",
    "description": "Carli Paukette is a sophomore at Central Michigan University and is a transfer student from Muskegon Community College, majoring in political science with a minor in criminal justice. She serves in an outreach position with the CMU College Democrats. Carli enjoys playing volleyball, spending time with animals (especially cats), and attending concerts. This year, her goal is to make a positive impact at CMU and help get Harris/Waltz elected in the upcoming election.",
    "objectPosition": [0, 0],
    "emailAddress": "pauke1ca@cmich.edu"
  },
  {
    "name": "Sky Austin",
    "title": "Director of the Voter Contact and Registration Board",
    "term": "2024 – Present",
    "description": "Hello, my name is Sky Austin, and I serve as the Director of Voter Contact and Registration for the Central Michigan University Democrats. I am currently a sophomore pursuing a Bachelor's Degree in Communication, with a minor in Political Science. Originally from Maryland, I consider Michigan my home away from home.\nIn addition to my role with the Democrats, I am the Community Outreach Chair for Black Girls Rock, an IMPACT Mentor, a student-athlete on the Women’s Track and Field Team and a Multicultural Advancement Scholar. I have also served as an Angela Alsobrooks Senate Fellow, a Democracy Summer Fellow under Congressman Jamie Raskin and am currently a Campus and Youth Vote Organizing Fellow for the Michigan Democratic Party.",
    "objectPosition": [0, 0],
    "emailAddress": "austi2sk@cmich.edu"
  },
  {
    "name": "Sonya Bennett",
    "title": "Voter Contact and Registration Board Member",
    "term": "2024 – Present",
    "description": "Hi, I'm Sonya Bennett. I'm apart of the CMU Dems Executive Board, specifically voter contact and registration. I'm currently a freshman going for a Bachelor of Fine Arts, Theater: Design and Tech within the College of Arts and Media. Along with my passion of theater another one of my goals in life is to make a difference whether that's through politics or just making a person smile. Things I do outside of the CMU Dems are, of course, any production I can be involved in, going to football games, and hanging with friends.",
    "objectPosition": [0, 0],
    "emailAddress": "benne3sj@cmich.edu"
  }
]